formulahendry.auto-close-tag
formulahendry.auto-rename-tag
aaron-bond.better-comments
coenraads.bracket-pair-colorizer
streetsidesoftware.code-spell-checker
mikestead.dotenv
dbaeumer.vscode-eslint
pomber.git-file-history
eamodio.gitlens
wix.vscode-import-cost
dbaeumer.jshint
christian-kohler.npm-intellisense
zhuangtongfa.material-theme
techer.open-in-browser
junstyle.php-cs-fixer
felixfbecker.php-intellisense
wongjn.php-sniffer
ikappas.phpcs
esbenp.prettier-vscode
hex-ci.stylelint-plus
gruntfuggly.todo-tree
pflannery.vscode-versionlens
sadesyllas.vscode-workspace-switcher
tungvn.wordpress-snippet