# Homebrew Taps
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Essential Applications
cask "brave-browser"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "google-chrome"
cask "insomnia"
cask "microsoft-edge"
cask "postman"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "warp"

# Developer Tools
brew "composer"
brew "git"
brew "node"
brew "nvm"
brew "php"
brew "php-code-sniffer"
brew "wp-cli"
brew "yarn"``

# Productivity Tools
cask "1password"
cask "amazon-q"
cask "font-fira-code"
cask "memory-clean-3"
cask "raindropio"
cask "rectangle"
cask "slack"
cask "zoom"
